# Robbie Tovar
## Week 12 11/7/24
### Python - Pandas series and data frame

- pandas is an open source python library used for working with data sets.
- it is used for analyzing, cleaning, exploring, importing, plotting, and manipoutaitng data
- fast and efficnet datfram object

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
print(pd.__version__)

1.0.5

In [5]:
s = pd.Series(np.arange(10))
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [6]:
s.index

RangeIndex(start=0, stop=10, step=1)

In [8]:
# creates labels
s = Series(np.arange(1,5), index=['w','x','y','z'])
s

w    1
x    2
y    3
z    4
dtype: int32

In [10]:
s['x']

2

In [11]:
s['x'] +s['w']

3

In [12]:
data = np.array(['a','b','c','d'])
s = Series(data, index = [100,101,102,103,])
s

100    a
101    b
102    c
103    d
dtype: object

In [13]:
summer_olympic = Series([2520,1122,937,847,713], index=['usa', 'russia','germany','uk','france'])
summer_olympic

usa        2520
russia     1122
germany     937
uk          847
france      713
dtype: int64

In [14]:
summer_olympic['usa']

2520

In [18]:
summer_olympic > 800

usa         True
russia      True
germany     True
uk          True
france     False
dtype: bool

In [15]:
summer_olympic[summer_olympic>800]

usa        2520
russia     1122
germany     937
uk          847
dtype: int64

In [16]:
'usa' in summer_olympic

True

In [19]:
d = summer_olympic.to_dict()
d

{'usa': 2520, 'russia': 1122, 'germany': 937, 'uk': 847, 'france': 713}

In [20]:
s = Series(d)
s

usa        2520
russia     1122
germany     937
uk          847
france      713
dtype: int64

In [22]:
countries = ['russia', 'france', 'spain', 'germany', 'usa', 'uk', 'italy']
s = Series(d, index=countries)
s

russia     1122.0
france      713.0
spain         NaN
germany     937.0
usa        2520.0
uk          847.0
italy         NaN
dtype: float64

In [23]:
pd.isnull(s)

russia     False
france     False
spain       True
germany    False
usa        False
uk         False
italy       True
dtype: bool

In [24]:
pd.notnull(s)

russia      True
france      True
spain      False
germany     True
usa         True
uk          True
italy      False
dtype: bool

In [27]:
summer_olympic

usa        2520
russia     1122
germany     937
uk          847
france      713
dtype: int64

In [26]:
s

russia     1122.0
france      713.0
spain         NaN
germany     937.0
usa        2520.0
uk          847.0
italy         NaN
dtype: float64

In [28]:
s.name = "Summer Olympoics"
s

russia     1122.0
france      713.0
spain         NaN
germany     937.0
usa        2520.0
uk          847.0
italy         NaN
Name: Summer Olympoics, dtype: float64

In [30]:
s.index.name = 'Country'
s

Country
russia     1122.0
france      713.0
spain         NaN
germany     937.0
usa        2520.0
uk          847.0
italy         NaN
Name: Summer Olympoics, dtype: float64

In [32]:
# data frame
#d ata fram is a 2 dimensionald ata structure, like a 2 dimension array 
data = {
    "calories": [420,380,390],
    "fruits": ['orange', 'banana', 'grape']
}
data

{'calories': [420, 380, 390], 'fruits': ['orange', 'banana', 'grape']}

In [33]:
#load data to a dataframe
df = DataFrame(data)
df

   calories  fruits
0       420  orange
1       380  banana
2       390   grape

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   calories  3 non-null      int64
 1   fruits    3 non-null      object
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [35]:
df.describe

<bound method NDFrame.describe of    calories  fruits
0       420  orange
1       380  banana
2       390   grape>

In [36]:
df['calories']

0    420
1    380
2    390
Name: calories, dtype: int64

In [37]:
df['fruits']

0    orange
1    banana
2     grape
Name: fruits, dtype: object

In [38]:
type(df['calories'])

pandas.core.series.Series

In [39]:
type(df['fruits'])

pandas.core.series.Series

In [40]:
df.loc[0]

calories       420
fruits      orange
Name: 0, dtype: object

In [45]:
df.loc[[0,2]]

   calories  fruits
0       420  orange
2       390   grape

In [46]:
df[['fruits','calories']]

   fruits  calories
0  orange       420
1  banana       380
2   grape       390

In [47]:
d = {
    'state': ['ohio','ohio','ohio', 'nevada', 'nevada', 'nevada'],
    'year': [2000,2001,2002,2001,2002,2003],
    'pop': [1.5,1.7,3.6,2.4,2.9,3.2]
}
d

{'state': ['ohio', 'ohio', 'ohio', 'nevada', 'nevada', 'nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [49]:
df = DataFrame(d)

df

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [50]:
df.head(3)

  state  year  pop
0  ohio  2000  1.5
1  ohio  2001  1.7
2  ohio  2002  3.6

In [51]:
df.tail(3)

    state  year  pop
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [55]:
#reorder the columns
df = DataFrame(df, columns=['year','state','pop'])
df

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  nevada  2.4
4  2002  nevada  2.9
5  2003  nevada  3.2

In [59]:
df = DataFrame(d, columns=['year','state','pop','debt'],
              index = ['1','2','3','4','5','6'])
df

   year   state  pop debt
1  2000    ohio  1.5  NaN
2  2001    ohio  1.7  NaN
3  2002    ohio  3.6  NaN
4  2001  nevada  2.4  NaN
5  2002  nevada  2.9  NaN
6  2003  nevada  3.2  NaN

In [60]:
df.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [61]:
df.index

Index(['1', '2', '3', '4', '5', '6'], dtype='object')

In [62]:
df['state']

1      ohio
2      ohio
3      ohio
4    nevada
5    nevada
6    nevada
Name: state, dtype: object

In [63]:
df.state

1      ohio
2      ohio
3      ohio
4    nevada
5    nevada
6    nevada
Name: state, dtype: object

In [67]:
df.loc['3']

year     2002
state    ohio
pop       3.6
debt      NaN
Name: 3, dtype: object

In [68]:
df.loc[['3','5']]

   year   state  pop debt
3  2002    ohio  3.6  NaN
5  2002  nevada  2.9  NaN

In [69]:
df

   year   state  pop debt
1  2000    ohio  1.5  NaN
2  2001    ohio  1.7  NaN
3  2002    ohio  3.6  NaN
4  2001  nevada  2.4  NaN
5  2002  nevada  2.9  NaN
6  2003  nevada  3.2  NaN

In [70]:
len(df['state'])

6

In [77]:
df['debt']=len(df['state'])

In [78]:
df

   year   state  pop  debt
1  2000    ohio  1.5     6
2  2001    ohio  1.7     6
3  2002    ohio  3.6     6
4  2001  nevada  2.4     6
5  2002  nevada  2.9     6
6  2003  nevada  3.2     6

In [79]:
df['debt']= np.arange(len(df['state']))

In [80]:
df

   year   state  pop  debt
1  2000    ohio  1.5     0
2  2001    ohio  1.7     1
3  2002    ohio  3.6     2
4  2001  nevada  2.4     3
5  2002  nevada  2.9     4
6  2003  nevada  3.2     5

In [81]:
df['debt'] = np.arange(np.rint(len(df['state'])))
df

   year   state  pop  debt
1  2000    ohio  1.5   0.0
2  2001    ohio  1.7   1.0
3  2002    ohio  3.6   2.0
4  2001  nevada  2.4   3.0
5  2002  nevada  2.9   4.0
6  2003  nevada  3.2   5.0

In [82]:
df['debt'] = np.random.random(6)
df

   year   state  pop      debt
1  2000    ohio  1.5  0.378786
2  2001    ohio  1.7  0.662225
3  2002    ohio  3.6  0.931800
4  2001  nevada  2.4  0.960072
5  2002  nevada  2.9  0.175263
6  2003  nevada  3.2  0.677451

In [87]:
df['debt'] = np.random.random(6) * 10
df

   year   state  pop      debt
1  2000    ohio  1.5  4.185015
2  2001    ohio  1.7  0.888949
3  2002    ohio  3.6  5.360742
4  2001  nevada  2.4  7.719689
5  2002  nevada  2.9  9.390480
6  2003  nevada  3.2  3.145517

In [85]:
df['debt']

1    7.648488
2    0.739037
3    6.409640
4    9.520865
5    7.390958
6    3.730513
Name: debt, dtype: float64

In [88]:
s = Series([-1.2,-1.5,-1.7], index=['2','4','5'])
s

2   -1.2
4   -1.5
5   -1.7
dtype: float64

In [89]:
df['debt']=s
df

   year   state  pop  debt
1  2000    ohio  1.5   NaN
2  2001    ohio  1.7  -1.2
3  2002    ohio  3.6   NaN
4  2001  nevada  2.4  -1.5
5  2002  nevada  2.9  -1.7
6  2003  nevada  3.2   NaN

In [90]:
df['eastern']= df['state'] == 'ohio'
df

   year   state  pop  debt  eastern
1  2000    ohio  1.5   NaN     True
2  2001    ohio  1.7  -1.2     True
3  2002    ohio  3.6   NaN     True
4  2001  nevada  2.4  -1.5    False
5  2002  nevada  2.9  -1.7    False
6  2003  nevada  3.2   NaN    False

In [93]:
#delete column 
del df['eastern']
df

   year   state  pop  debt
1  2000    ohio  1.5   NaN
2  2001    ohio  1.7  -1.2
3  2002    ohio  3.6   NaN
4  2001  nevada  2.4  -1.5
5  2002  nevada  2.9  -1.7
6  2003  nevada  3.2   NaN

In [94]:
df[df['pop']> 2.4]

   year   state  pop  debt
3  2002    ohio  3.6   NaN
5  2002  nevada  2.9  -1.7
6  2003  nevada  3.2   NaN

In [95]:
df

   year   state  pop  debt
1  2000    ohio  1.5   NaN
2  2001    ohio  1.7  -1.2
3  2002    ohio  3.6   NaN
4  2001  nevada  2.4  -1.5
5  2002  nevada  2.9  -1.7
6  2003  nevada  3.2   NaN